### NSUserActivity와 CSSearchableItem의 차이

* **NSUserActivity**
> 특정 시점의 앱 상태를 나타내는 표현
>
> 즉, 사용자가 앱에서 특정 시점에 한 행동을 저장하는 것이다.
예를 들면, 사용자가 본 내용이나 웹페이지, 비디오, 수정한 내용 등이다.
>
> **Spotlight**에서도 activity를 이용하면 향상된 검색결과를
만들어 낼 수 있다.
>
> 보통 웹페이지를 열거나, 백그라운드 상태로 갈 때, 특정 원하는 행동을
할 때 등에 activity를 만들면 된다.

참고 : 처음에 activity에 대한 개념이 없어서 클래스업에
사용했는데 클래스업에는 아직 사용할 필요가 없었다.

*즉, 사용자의 행동에 관련한 정보를 저장하고 찾을 때는
**NSUserActivity**를 사용하고 글, 사진과 같은 정보를 찾을 때는
**Core Spotlight**를 사용한다.*

참고 : 클래스업은 *Core Spotlight API*만 사용하면 된다.
